"""
Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.
"""
number = int(input("Введите число: "))
k = 2
count = 1
while k <= number:
    print(f"Cтепень двойки: 2 ** {count} = {k}")
    k = k * 2
    count += 1
