no_contact_or_file = 'Телефонная книга пуста или не открыта'

load_successful = 'Телефонная книга успешно загружена'

save_successful = 'Телефонная книга успешно сохранена'

new_contact_successful = 'Контакт успешно создан!'
find_contact_successful = 'Контакт успешно найден!'
dont_find_contact = 'Контакт не найден'

new_name = 'Введите имя контакта: '
new_family = 'Введите фамилию контакта: '
new_phone = 'Введите телефон контакта: '
new_comment = 'Введите комментарий к контакту: '

is_changed = 'Были внесены изменения. Сохранить? '

bye_bye = 'До свидания! Всего хорошего'
